# BendingDetailTypeShowAngularDimensionsFor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeShowAngularDimensionsFor Property
ParameterTypeId Class See Also
---
"Show for Angles"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeShowAngularDimensionsFor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeShowAngularDimensionsFor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeShowAngularDimensionsFor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace